package com.example.currencyexchange.data.currencymodel

object CurrencySymbols {
    val symbols = mapOf(
        "AUD" to "A$",  // Австралийский доллар
        "AZN" to "₼",    // Азербайджанский манат
        "GBP" to "£",    // Фунт стерлингов
        "AMD" to "֏",    // Армянский драм
        "BYN" to "Br",   // Белорусский рубль
        "BGN" to "лв",   // Болгарский лев
        "BRL" to "R$",   // Бразильский реал
        "HUF" to "Ft",   // Венгерский форинт
        "VND" to "₫",    // Вьетнамский донг
        "HKD" to "HK$",  // Гонконгский доллар
        "GEL" to "₾",    // Грузинский лари
        "DKK" to "kr",   // Датская крона
        "AED" to "د.إ",  // Дирхам ОАЭ
        "USD" to "$",    // Доллар США
        "EUR" to "€",    // Евро
        "EGP" to "£",    // Египетский фунт
        "INR" to "₹",    // Индийская рупия
        "IDR" to "Rp",   // Индонезийская рупия
        "KZT" to "₸",    // Казахстанский тенге
        "CAD" to "C$",   // Канадский доллар
        "QAR" to "ر.ق",  // Катарский риал
        "KGS" to "с",    // Киргизский сом
        "CNY" to "¥",    // Китайский юань
        "MDL" to "L",    // Молдавский лей
        "NZD" to "NZ$",  // Новозеландский доллар
        "NOK" to "kr",   // Норвежская крона
        "PLN" to "zł",   // Польский злотый
        "RON" to "lei",  // Румынский лей
        "XDR" to "XDR",  // СДР (специальные права заимствования)
        "SGD" to "S$",   // Сингапурский доллар
        "TJS" to "ЅМ",   // Таджикский сомони
        "THB" to "฿",    // Тайский бат
        "TRY" to "₺",    // Турецкая лира
        "TMT" to "m",    // Туркменский манат
        "UZS" to "so'm", // Узбекский сум
        "UAH" to "₴",    // Украинская гривна
        "CZK" to "Kč",   // Чешская крона
        "SEK" to "kr",   // Шведская крона
        "CHF" to "CHF",  // Швейцарский франк
        "RSD" to "дин",  // Сербский динар
        "ZAR" to "R",    // Южноафриканский рэнд
        "KRW" to "₩",    // Южнокорейская вона
        "JPY" to "¥",    // Японская иена
        "RUB" to "₽"     // Российский рубль
    )
}